
## Terraform plan for environment: `int`

**Commit:** 6cc37b9f5f86c3f58d2d6d67543afd836ce61218


**API version:** 418eb0c
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`41 to add, 4 to change, 70 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudfront_function.rewrite_uri
module.service.module.batch.aws_batch_compute_environment.this["fargate"]
module.service.module.batch.aws_iam_instance_profile.instance[0]
module.service.module.batch.aws_iam_role.instance[0]
module.service.module.batch.aws_iam_role.service[0]
module.service.module.batch.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"]
module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac_int"]
module.service.module.ecs_cluster["api"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["api"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["api"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["api"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["api"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_cluster["internal"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["internal"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["internal"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["internal"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["internal"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_cluster["selfserve"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["selfserve"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["selfserve"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["selfserve"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["selfserve"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["api"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.tasks[0]
module.service.module.ecs_service["api"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.tasks[0]
module.service.module.ecs_service["internal"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.tasks[0]
module.service.module.ecs_service["selfserve"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.log_bucket.aws_s3_bucket.this[0]
module.service.module.ecs_service["api"].module.container_definition["api"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_service["internal"].module.container_definition["internal"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_service["selfserve"].module.container_definition["selfserve"].aws_cloudwatch_log_group.this[0]
```
**🗑️ Deletes**

```tf
module.service.aws_cloudwatch_log_group.this
module.service.aws_lb_target_group.this["api"]
module.service.aws_lb_target_group.this["internal"]
module.service.aws_lb_target_group.this["selfserve"]
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.batch.aws_batch_job_queue.this["default"]
module.service.module.batch.aws_batch_scheduling_policy.this["default"]
module.service.module.batch.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"]
module.service.module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac_qa"]
module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["api"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["api"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["internal"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_iam_role_policy.tasks[0]
module.service.module.log_bucket.aws_s3_bucket_acl.this[0]
module.service.module.log_bucket.aws_s3_bucket_ownership_controls.this[0]
module.service.module.log_bucket.aws_s3_bucket_public_access_block.this[0]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
```
**🔄 Updates**

```tf
module.service.aws_lb_listener_rule.this["api"]
module.service.aws_lb_listener_rule.this["internal"]
module.service.aws_lb_listener_rule.this["selfserve"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.aws_cloudfront_function.rewrite_uri must be replaced
+/- resource "aws_cloudfront_function" "rewrite_uri" {
      ~ arn                          = "arn:aws:cloudfront::054614622558:function/qa-legacy-assets-rewrite-uri" -> (known after apply)
      ~ etag                         = "ETVPDKIKX0DER" -> (known after apply)
      ~ id                           = "qa-legacy-assets-rewrite-uri" -> (known after apply)
      - key_value_store_associations = [] -> null
      ~ live_stage_etag              = "ETVPDKIKX0DER" -> (known after apply)
      ~ name                         = "qa-legacy-assets-rewrite-uri" -> "int-legacy-assets-rewrite-uri" # forces replacement
      ~ status                       = "DEPLOYED" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:eu-west-1:054614622558:log-group:/aws/batch/vol-app-qa" -> (known after apply)
      ~ id                = "/aws/batch/vol-app-qa" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/batch/vol-app-qa" -> "/aws/batch/vol-app-int" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.service.aws_lb_listener_rule.this["api"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "this" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:listener-rule/app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc/079795fb21af88e7/41ccf5e062767eaa"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-api-tg/4ad150e01a8157e4" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.service.aws_lb_listener_rule.this["internal"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "this" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:listener-rule/app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e/4c6cdab6c475f605/55e67e74cccb1b01"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-internal-tg/f6f7409064eb47b6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.service.aws_lb_listener_rule.this["selfserve"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "this" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:listener-rule/app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3/b92208df7025b367/d4eb5a4acb148eb3"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-selfserve-tg/a1fac1d596cd4d07" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.service.aws_lb_target_group.this["api"] must be replaced
-/+ resource "aws_lb_target_group" "this" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-api-tg/4ad150e01a8157e4" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/vol-app-qa-api-tg/4ad150e01a8157e4" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-api-tg/4ad150e01a8157e4" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:eu-west-1:054614622558:loadbalancer/app/DEVAPPQA-OLCS-PRI-SVCS-ALB/b21df94bee7afbcc",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "vol-app-qa-api-tg" -> "vol-app-int-api-tg" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
        # (9 unchanged attributes hidden)

      ~ stickiness {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_failover {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_group_health {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_health_state {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.service.aws_lb_target_group.this["internal"] must be replaced
-/+ resource "aws_lb_target_group" "this" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-internal-tg/f6f7409064eb47b6" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/vol-app-qa-internal-tg/f6f7409064eb47b6" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-internal-tg/f6f7409064eb47b6" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:eu-west-1:054614622558:loadbalancer/app/DEVAPPQA-OLCS-PRI-IUWEB-ALB/5d7b89e0d93d5b1e",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "vol-app-qa-internal-tg" -> "vol-app-int-internal-tg" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
        # (9 unchanged attributes hidden)

      ~ stickiness {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_failover {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_group_health {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_health_state {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.service.aws_lb_target_group.this["selfserve"] must be replaced
-/+ resource "aws_lb_target_group" "this" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-selfserve-tg/a1fac1d596cd4d07" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/vol-app-qa-selfserve-tg/a1fac1d596cd4d07" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-qa-selfserve-tg/a1fac1d596cd4d07" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:eu-west-1:054614622558:loadbalancer/app/DEVAPPQA-OLCS-PRI-SSWEB-ALB/becaba98d0276fd3",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "vol-app-qa-selfserve-tg" -> "vol-app-int-selfserve-tg" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
        # (9 unchanged attributes hidden)

      ~ stickiness {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_failover {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_group_health {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_health_state {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.service.module.batch.aws_batch_compute_environment.this["fargate"] must be replaced
+/- resource "aws_batch_compute_environment" "this" {
      ~ arn                             = "arn:aws:batch:eu-west-1:054614622558:compute-environment/vol-app-qa-fargate-20240805162358677200000015" -> (known after apply)
      ~ compute_environment_name        = "vol-app-qa-fargate-20240805162358677200000015" -> (known after apply)
      ~ compute_environment_name_prefix = "vol-app-qa-fargate-" -> "vol-app-int-fargate-" # forces replacement
      ~ ecs_cluster_arn                 = "arn:aws:ecs:eu-west-1:054614622558:cluster/vol-app-qa-fargate-20240805162358677200000015_Batch_271485f8-5cc9-3a7e-9666-dc12a4ade285" -> (known after apply)
      ~ id                              = "vol-app-qa-fargate-20240805162358677200000015" -> (known after apply)
      ~ service_role                    = "arn:aws:iam::054614622558:role/vol-app-qa-batch-service-20240805162356721700000001" -> (known after apply)
      ~ status                          = "VALID" -> (known after apply)
      ~ status_reason                   = "ComputeEnvironment Healthy" -> (known after apply)
      - tags                            = {} -> null
        # (3 unchanged attributes hidden)

      ~ compute_resources {
          - bid_percentage      = 0 -> null
          ~ desired_vcpus       = 0 -> (known after apply)
          - instance_type       = [] -> null
          - min_vcpus           = 0 -> null
          - tags                = {} -> null
            # (10 unchanged attributes hidden)

          ~ ec2_configuration {
              + allocation_strategy = (known after apply)
              + bid_percentage      = (known after apply)
              + desired_vcpus       = (known after apply)
              + ec2_key_pair        = (known after apply)
              + image_id            = (known after apply)
              + instance_role       = (known after apply)
              + instance_type       = (known after apply)
              + max_vcpus           = (known after apply)
              + min_vcpus           = (known after apply)
              + placement_group     = (known after apply)
              + security_group_ids  = (known after apply)
              + spot_iam_fleet_role = (known after apply)
              + subnets             = (known after apply)
              + tags                = (known after apply)
              + type                = (known after apply)
            } -> (known after apply)
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-cancel-unsubmitted-bilateral:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-cancel-unsubmitted-bilateral" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "permits:cancel-unsubmitted-bilateral",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "cancel-unsubmitted-bilateral"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-cancel-unsubmitted-bilateral:1" -> (known after apply)
      ~ name                       = "vol-app-qa-cancel-unsubmitted-bilateral" -> "vol-app-int-cancel-unsubmitted-bilateral" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-ch-vs-olcs-diffs:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-ch-vs-olcs-diffs" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "batch:ch-vs-olcs-diffs",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "ch-vs-olcs-diffs"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-ch-vs-olcs-diffs:1" -> (known after apply)
      ~ name                       = "vol-app-qa-ch-vs-olcs-diffs" -> "vol-app-int-ch-vs-olcs-diffs" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-clean-up-variations:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-clean-up-variations" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "batch:clean-up-variations",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "clean-up-variations"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-clean-up-variations:1" -> (known after apply)
      ~ name                       = "vol-app-qa-clean-up-variations" -> "vol-app-int-clean-up-variations" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-close-expired-windows:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-close-expired-windows" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "permits:close-expired-windows",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "close-expired-windows"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-close-expired-windows:1" -> (known after apply)
      ~ name                       = "vol-app-qa-close-expired-windows" -> "vol-app-int-close-expired-windows" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-cns:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-cns" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "batch:cns",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "cns"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-cns:1" -> (known after apply)
      ~ name                       = "vol-app-qa-cns" -> "vol-app-int-cns" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-company-profile-dlq:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-company-profile-dlq" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "queue:company-profile-dlq",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "company-profile-dlq"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-company-profile-dlq:1" -> (known after apply)
      ~ name                       = "vol-app-qa-company-profile-dlq" -> "vol-app-int-company-profile-dlq" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-create-psv-licence-surrender-task:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-create-psv-licence-surrender-task" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "batch:create-psv-licence-surrender-task",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "create-psv-licence-surrender-task"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-create-psv-licence-surrender-task:1" -> (known after apply)
      ~ name                       = "vol-app-qa-create-psv-licence-surrender-task" -> "vol-app-int-create-psv-licence-surrender-task" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-delete:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-delete" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "batch:data-retention",
                  - "--delete",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "data-retention-delete"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-delete:1" -> (known after apply)
      ~ name                       = "vol-app-qa-data-retention-delete" -> "vol-app-int-data-retention-delete" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-populate:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-populate" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "batch:data-retention",
                  - "--populate",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "data-retention-populate"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-populate:1" -> (known after apply)
      ~ name                       = "vol-app-qa-data-retention-populate" -> "vol-app-int-data-retention-populate" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-postcheck:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-postcheck" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "batch:data-retention",
                  - "--postcheck",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                    },
                  - {
                      - name  = "APP_VERSION"
                      - value = "418eb0c"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-20240805162358379100000010"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:418eb0c"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-qa-api-service-2024080516235832250000000d"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-qa"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "data-retention-postcheck"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> (known after apply)
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-postcheck:1" -> (known after apply)
      ~ name                       = "vol-app-qa-data-retention-postcheck" -> "vol-app-int-data-retention-postcheck" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-precheck:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-qa-data-retention-precheck" -> (known after apply)
      ~ container_properties       = jsonencode(
            {
              - command                      = [
                  - "/var/www/html/vendor/bin/laminas",
                  - "--container=/var/www/html/config/container-cli.php",
                  - "batch:data-retention",
                  - "--precheck",
                ]
              - environment                  = [
                  - {
                      - name  = "ENVIRONMENT_NAME"
                      - value = "qa"
                  ... (truncated, see full plan in the workflow run logs)
```

</details>